'''
Повторяй за мной 1
Дано предложение и количество раз которое его надо повторить. Напишите программу, которая повторяет данное предложение нужное количество раз.

Формат входных данных
В первой строке записано текстовое предложение, во второй — количество повторений.

Формат выходных данных
Программа должна вывести указанное текстовое предложение нужное количество раз. Каждое повторение должно начинаться с новой строки.
'''

# proposal = input()
# repeat = int(input())
# for _ in range(repeat):
#     print(proposal)

a = int(input())
b = int(input())

summ = a + b
summ /= 3
print(summ)
# if summ / 3